Revit 2027 API
BuiltInExternalServices Properties
The ExternalServices.BuiltInExternalServices type exposes the following members.
Properties
Name | Description
AlignmentService |  Autodesk Internal: The service for Infrastructure Alignments
AnalyticalCurrentCalculationService |  AnalyticalCurrentCalculationService GUID value:{96BBB101-FDDB-4991-BB41-FBC1BE1552BB} The calculation service for Electrical Analytical Distribution System
ATFTranslationService
AXMImporterService | Obsolete.
 The external service which permits registration of an alternate implementation for AXM import.
CloudExternalService |  The external service which supports get cloud model information from cloud servers such as C4R.
CodeCheckingParameterService |  The external service supporting view and modification of the structural code checking parameter in analytical elements. To use this service, programmers implement a server class that derives from ICodeCheckingParameterServer.
ConnectionTypeChangedService |  The external service used to notify when structural connection changed the type.
CustomFieldEditPropertiesService |  Autodesk Internal: The service for editing properties of a custom field.
CustomFieldService |  Autodesk Internal: The service for updating the custom fields of a schedule.
DirectContext3DService |  The external service that provides the facility to draw externally specified geometry in a Revit view in a way that is conceptually similar to a low-level graphics API. To use this service, programmers implement a server class that derives from Autodesk::Revit::DB::DirectContext3D::IDirectContext3DServer.
DuctFittingAndAccessoryPressureDropService |  The external service Id which permits registration of an alternate implementation for duct fitting and accessory pressure drop calculation. To use this service, programmers implement a server class that derives from IDuctFittingAndAccessoryPressureDropServer.
DuctFittingAndAccessoryPressureDropUIService |  The external service which permits registration of an alternate implementation for a duct fitting and accessory pressure drop calculation UI. To use this service, programmers implement a server class that derives from IDuctFittingAndAccessoryPressureDropUIServer.
DuctPressureDropService |  The external service which permits registration of an alternate implementation for duct pressure drop calculation. To use this service, programmers implement a server class that derives from IDuctPressureDropServer.
ElectricalAnalyticalLoadCombinationUIService |  The UI service which permits registration of an external server for UI managing Electrical Analytical Load Combination.
EntitlementExternalService |  The external service which supports get entitlement information.
ExtendedPropertiesUIService |  The external UI service which permits registration of an alternate servers for new UI of link extended properties
ExternalDataManagerService
ExternalDataTypeService |  Unique service id.
ExternalParameterService |  Autodesk Internal: The service for shared parameter selection.
ExternalResourceService |  The external service which permits registration of an alternate servers for managing external resources such as linked files.
ExternalResourceUIService |  The external UI service Id which permits registration of an alternate servers for managing error messages which happen at the loading of the references to external resources such as linked files.
ExternalUIService |  Unique service id.
ForgeSchemaService |  Autodesk Internal: The service for interacting with the Forge Schema Service.
FramingProfileService |  The external service responsible for the generation of the fabrication profile.
GenericRepoHelperService |  Unique service id.
GeolocationServices |  Autodesk Internal: The unique id for working with geolocation services
GeometryAugmentationService |  Autodesk Internal: The service where GeometryAugmentationServers can be registered.
HoleDefinitionService |  The external service to view and modify hole definition parameters.
IFCConfigurationUpgradeService |  The service which performs IFC configuration upgrades during document open.
IFCEntityTreeUIService |  The UI service which permits registration of an external server for new UI managing IFCEntity Selection
IFCExporterService |  The external service which permits registration of an alternate implementation for IFC export.
IFCImporterService |  The external service which permits registration of an alternate implementation for IFC import.
MacroManagerUIService |  The UI service which permits registration of an external server for new Macro Manager UI.
MemberForcesService |  The external service supporting view and modification of the member forces in analytical elements. The service is still under development and cannot be used. It means that no server can be external registered from it yet.
ModelAccessValidationService |  The external service which validates the access to Revit model such as Revit Cloud model.
ModifyConnectionParametersService |  The external service to view and modify structural connection parameters.
ModifyConnectionRangesService |  The external service to view and modify structural connection ranges of applicability.
NavisworksExporterService |  The external service which supports export of the model to Navisworks.
PathOfTravelCalculationService |  Autodesk Internal: The service for path of travel calculations
PipeFittingAndAccessoryPressureDropService |  The external service which permits registration of an alternate implementation for pipe fitting and accessory pressure drop calculation. To use this service, programmers implement a server class that derives from IPipeFittingAndAccessoryPressureDropServer.
PipeFittingAndAccessoryPressureDropUIService |  The external service which permits registration of an alternate implementation for a pipe fitting and accessory pressure drop calculation UI. To use this service, programmers implement a server class that derives from IPipeFittingAndAccessoryPressureDropUIServer.
PipeFrictionFactorService |  Pipe friction factor service id
PipePlumbingFixtureFlowService |  The external service which permits registration of an alternate implementation for pipe fixture flow calculation. To use this service, programmers implement a server class that derives from IPipePlumbingFixtureFlowServer.
PipePressureDropService |  The external service which permits registration of an alternate implementation for pipe pressure drop calculation. To use this service, programmers implement a server class that derives from IPipePressureDropServer.
RebarSpliceService |  Autodesk Internal: The service for spliping a rebar.
RebarUpdateService |  Autodesk Internal: The service for updating rebar freeform elements
RevisionsOnSheetUIService |  The UI service which permits registration of an external server for new UI managing RevisionsOnSheet selection
SiteInsertService |  The external service which permits registration of an alternate implementation for Site insert.
SiteLinkerUIService |  The external UI service which permits registration of an alternate servers for new UI of link topography
SnappingService |  Autodesk Internal: The service which provides snap points and lines
StructuralSectionsService |  The external service supporting view and modification of the structural sections shape in structural elements. The service is still under development and cannot be used. It means that no server can be external registered from it yet.
TemporaryGraphicsHandlerService |  The external service Id which permits registration of an callback handler for temporary graphics objects managed by [!:Autodesk::Revit::DB::TemporaryGraphicsManager]. To use this service, developers implement a server class that derives from [!:Autodesk::Revit::UI::ITemporaryGraphicsHandler].
ViewSheetSetUIService |  The UI service which permits registration of an external server for new UI managing ViewSheetSet.
WallPlacementPostProcessingService |  Autodesk Internal: The service for post processing something after placing a wall
Top
See Also
Reference
ExternalServices.BuiltInExternalServices Class
Autodesk.Revit.DB.ExternalService Namespace